{
    "guiltyNames": ["Matthew", "Harold", "Diana", "Sebastian", "Bobby", "Isabella", "Jessie", "Celeste"],
    "objectivesInMenu": 
    [
        {
            "phase": "Default",
            "subphase": "Default",
            "objective": "Simplemente debo seguir con la investigación"
        },
        {
            "phase": "Prologue",
            "subphase": "Talk to Father (Phone)",
            "objective": "Me han dejado a cargo de la casa, así que debería comprobar que todo sigue en su sitio"
        },
        {
            "phase": "Prologue",
            "subphase": "Inspect the Toaster",
            "objective": "Tengo hambre, debería ponerle remedio a eso"
        },
        {
            "phase": "Puzzle1",
            "subphase": "Talk to Inspector 1",
            "objective": "Debo salir de casa para investigar lo sucedido"
        },
        {
            "phase": "Puzzle1",
            "subphase": "Inspect the Backpack",
            "objective": "El inspector Montgomery me ha pedido ayuda para buscar su mochila"
        },
        {
            "phase": "Puzzle1",
            "subphase": "Talk to Inspector 2",
            "objective": "Ya sé dónde está la mochila, debería hacérselo saber al inspector"
        },
        {
            "phase": "Puzzle1",
            "subphase": "Talk to Physio 1",
            "objective": "Debería ver cómo está de ánimos Sarah"
        },
        {
            "phase": "Puzzle1",
            "subphase": "Ready for Puzzle 1",
            "objective": "Sarah me ha dicho que ayer el señor Martin rompió una hoja de papel y la tiró. Debo encontrarla"
        },
        {
            "phase": "Puzzle2",
            "subphase": "Talk to Physio 2",
            "objective": "Debo decirle a Sarah lo que he descubierto"
        },
        {
            "phase": "Puzzle2",
            "subphase": "Inspect the Skeleton",
            "objective": "¿A qué se referirá el señor Martin con que hay un 'hombre' más viejo que él en la entrada de la mansión?"
        },
        {
            "phase": "Puzzle2",
            "subphase": "Talk to Physio 3",
            "objective": "Aunque haya sido decepcionante no encontrar nada, debería contarle las novedades a Sarah"
        },
        {
            "phase": "Puzzle2",
            "subphase": "Ready for Puzzle 2",
            "objective": "Debo encontrar un objeto relacionado con el 'TIEMPO'"
        },
        {
            "phase": "Puzzle3",
            "subphase": "Inspect the Bookcase",
            "objective": "El libro que he encontrado debe ir en un sitio adecuado que esté más al este"
        },
        {
            "phase": "Puzzle3",
            "subphase": "Inspect the Hall Mirror",
            "objective": "Debe haber algo en esta mansión para ver la frase que escribí en mi diario del revés, es decir, para verla reflejada"
        },
        {
            "phase": "Puzzle3",
            "subphase": "Ready for Puzzle 3",
            "objective": "Tengo que resolver el acertijo que dice 'una esfera con la que ver el mundo completo'"
        },
        {
            "phase": "Puzzle3",
            "subphase": "Talk to Physio 4",
            "objective": "Una vez he encontrado la llave misteriosa solo se me ocurre que me pueda ayudar Sarah"
        },
        {
            "phase": "Puzzle4",
            "subphase": "Inspect the Coffe Maker",
            "objective": "Como me ha dicho Sarah, debo encontrar algo para mojar la llave en cafeína"
        },
        {
            "phase": "Puzzle4",
            "subphase": "Ready for Puzzle 4",
            "objective": "Ya tengo la llave lista para abrir el cajón del escritorio"
        },
        {
            "phase": "Puzzle5",
            "subphase": "Inspect the Signboard",
            "objective": "Con esta nueva información, mi siguiente paso es ir al parque, seguramente en la entrada haya algún cartel que ayude a seguir"
        },
        {
            "phase": "Puzzle5",
            "subphase": "Talk to Park Manager 1",
            "objective": "Debo encontrar a la directora del parque en el puesto de limonada"
        },
        {
            "phase": "Puzzle5",
            "subphase": "Ready for Puzzle 5",
            "objective": "El señor Martin ha perdido un tablero de ajedrez, a lo mejor encontrarlo me da pistas de cómo seguir"
        },
        {
            "phase": "Puzzle6",
            "subphase": "Inspect the Binoculars",
            "objective": "En este parque debe haber algo que cumpla la condición de 'verás más si me pones en tus ojos'"
        },
        {
            "phase": "Puzzle6",
            "subphase": "Inspect the Painting",
            "objective": "Debo encontrar el objeto que, al mirar con los prismáticos directamente al norte, intercede en mi visión"
        },
        {
            "phase": "Puzzle6",
            "subphase": "Ready for Puzzle 6",
            "objective": "En la pintura que miré antes había un globo rojo, tiene que significar algo"
        },
        {
            "phase": "Puzzle7",
            "subphase": "Talk to Park Manager 2",
            "objective": "He encontrado una carta de una baraja de póker, no sé lo que significa pero Grace a lo mejor sí"
        },
        {
            "phase": "Puzzle7",
            "subphase": "Inspect the Sandbox",
            "objective": "Grace me ha dicho que necesito una moneda especial, la última vez fue vista con un niño revoltoso y lleno de arena"
        },
        {
            "phase": "Puzzle7",
            "subphase": "Ready for Puzzle 7",
            "objective": "Simplemente debo dirigirme a la cabaña caribeña que hay en el lago"
        },
        {
            "phase": "Ending",
            "subphase": "Ending Beginning",
            "objective": "Tengo todos los elementos para resolver el caso"
        },
        {
            "phase": "Ending",
            "subphase": "Ending Beginning",
            "objective": "Tengo todos los elementos para resolver el caso"
        },
        {
            "phase": "Ending",
            "subphase": "Post End",
            "objective": "El caso ya está cerrado. Lo único que puedo hacer ahora es repasar la investigación en mi ordenador"
        }
    ],
    "puzzle0": 
    {
        "puzzleStatementText": "",
        "firstSupportText": "",
        "secondSupportText": "",
        "thirdSupportText": ""
    },
    "puzzle1": 
    {
        "puzzleStatementText": "Parece que en la nota hecha por la víctima no se puede ver ni el principio ni el final de lo que había escrito. Lo único que se distingue es una palabra. Por lo visto, ha probado varios términos hasta que ha conseguido encontrar lo que quería escribir.\n\nHe descubierto que hay un patrón claro entre todos los intentos que ha hecho, pero aún así no logro ver la palabra que estaba buscando. ¿Cuál podrá ser?\n\nEl patrón que he pensado me dice que una letra del abecedario puede aparecer o no en la palabra final. En función de esto, cada letra se presenta de manera diferente: \n\n- Si la letra sale tachada no está presente en la palabra final.\n- Si la letra sale rodeada por un círculo está presente en la palabra final pero no en su posición correcta.\n- Si la letra aparece sin nada está presente en la palabra final y en su posición.\n\nAdemás, en algunas letras no se han dibujado bien al hacer la transcripción y puede que falte una o dos líneas. Aún así, debería ser capaz de encontrar la palabra que quería escribir la víctima.",
        "firstSupportText": "Si te fijas bien en todos los intentos que se han realizado las palabras existen de verdad (aunque puede ser dificil de ver al principio ya que se ha perdido alguna línea). Esto debería ayudarte a sacar las letras que están incompletas. Sobretodo si te fijas en la segunda palabra. Si aún así no puedes, mira en el abecedario cuáles podrían entrar en ese hueco yendo una por una.",
        "secondSupportText": "La víctima solo ha tenido un fallo y es que se le ha olvidado poner una letra que sabía que estaba en la primera palabra en el siguiente intento. Lo que no ha hecho nunca es poner una letra en la misma posición, en el siguiente intento, si sabe que ahí no va.",
        "thirdSupportText": "Sabiendo que hay una letra que aparece en todos los intentos, y otra que solo lo hace en los dos últimos, deberías ser capaz de colocar esas dos. Junto con las dos que ya están su sitio, es coser y cantar."
    },
    "puzzle2": 
    {
        "puzzleStatementText": "Se ve justo encima del péndulo una placa que dice:\n\n“El reloj presenta tres manecillas para marcar la hora, los minutos y los segundos. Estas son el horario, el minutero y el segundero, respectivamente. Además, tenga en cuenta que para un correcto mantenimiento del reloj, el mecanismo de seguridad solo permite su apertura una vez al día, cuando las manecillas están en una posición concreta que cumple las siguientes condiciones:\n\n1) El horario y el minutero deben señalar dos números, que, combinados, contengan mínimo los tres dígitos romanos: I, V y X.\n2) El minutero siempre se encuentra debajo del horario.\n3) La suma de los números romanos que indican el horario y el minutero debe dar como resultado un número impar.\n4) Las manecillas del horario y el minutero forman siempre un ángulo mayor a 90 grados.\n5) Los números romanos señalados por las tres manecillas deben tener una cantidad diferente de dígitos cada uno.\n6) El segundero se encuentra en el ángulo más pequeño que forman el horario y el minutero.\n7) El segundero no tiene ninguna otra manecilla señalando los números adyacentes al suyo.”\n\n¿A qué hora puedo abrir ya el reloj?",
        "firstSupportText": "Intenta averiguar primero a dónde señala el horario y el minutero. Una vez tengas esto, colocar el segundero se hace directamente siguiendo las dos últimas condiciones.",
        "secondSupportText": "Si lo piensas detenidamente no existe en un reloj ningún número que tenga los dígitos romanos X y V a la vez. Con esta información, la primera indicación cobra especial relevancia. Sumado a la segunda, deberías ser capaz de ver que solo hay unos pocos números en los que se puede encontrar el horario y el minutero. ",
        "thirdSupportText": "Para que una suma sea impar, tiene que darse que uno de los sumandos sea par y el otro no. A partir de aquí, probando todas las combinaciones posibles, según la tercera y cuarta condición, solo hay una que cumpla lo que dice la quinta."
    },
    "puzzle3": 
    {
        "puzzleStatementText": "Viendo el diario de viaje de la víctima hay una página que me llama especialmente la atención. En ella aparece un mapa de Europa con varias anotaciones hechas. A lo mejor me sirve de ayuda leer lo que tiene escrito para saber dónde tengo que pulsar:\n\n“Cansado del ritmo de vida que llevaba hasta entonces decidí hacer un viaje que a la postre acabaría siendo el mejor que he hecho en mi vida. \n\nPara empezar, me puse el objetivo de no ir nunca en avión, solo me movería haciendo uso de coches o barcos. Por ello, mi única opción era viajar entre ciudades que estuvieran directamente conectadas por uno de estos medios. Además, también me propuse pasar por todos los sitios que siempre quise visitar sin repetir ninguno.\n\nFue un viaje muy largo, y por momentos complicado. Pero sin duda alguna fue una experiencia que me cambió la vida.”\n\nLeyendo esto, mi intuición me dice que para seguir adelante tengo que pulsar los países en el mismo orden por los que pasó la víctima en su viaje. Para ello, tengo que llegar desde el comienzo del viaje (el punto A) hasta el final (el punto S) pasando por cada lugar solo una vez.",
        "firstSupportText": "Parece un poco obvio, pero no tienes que pasar por todas las conexiones que hay entre las diferentes regiones. Solo debes asegurarte de visitar todas las localizaciones que hay sin repetir ninguna. Simplemente probando, debería ser fácil llegar a la solución.",
        "secondSupportText": "Si conocieras a la víctima sabrías que lo primero que hizo nada más salir del punto A es ir lo más al este posible.",
        "thirdSupportText": "En el último tramo del viaje, antes de llegar al punto S, la víctima tuvo que hacer el recorrido en barco y después en coche."
    },
    "puzzle4": 
    {
        "puzzleStatementText": "He metido la llave en la cerradura, pero aún así sigue sin abrirse el cajón del escritorio. Buscando cómo solucionar esto me he fijado que hay tres filas de símbolos encima del cierre, formando cada una un patrón concreto. Además, justo al lado de cada sucesión de cuadros hay uno vacío, que parece que funciona como panel donde se puede poner algo.\n\nDespués de darle un par de vueltas, tengo claro que para poder mirar lo que hay dentro del cajón, tengo que encontrar el siguiente símbolo en cada una de las tres sucesiones.\n\n¿Cómo sigue cada patrón?",
        "firstSupportText": "Para descifrar el patrón de la primera secuencia simplemente fíjate en cómo va moviendo la “T” de un cuadro al siguiente.",
        "secondSupportText": "Parece que el segundo patrón tiene que ver más que nada con la simetría. Por lo tanto, para poder resolverlo, simplemente preguntaté qué pasa cuándo se introduce un nuevo cuadrado.",
        "thirdSupportText": "La tercera sucesión de símbolos es un poco diferente a las anteriores. Mientras que en las otras había que mirar solo el cuadro previo de la misma fila, aquí hay que tener una visión más global. Simplemente digamos que es el único patrón en el que hay que mirar también a los demás. "
    },
    "puzzle5": 
    {
        "puzzleStatementText": "Parece que este es un tablero de ajedrez un poco más especial de lo habitual. Hay tres reinas colocadas, cada una en su respectiva casilla, y haga lo que haga, me resulta imposible moverlas de su sitio. Además, justo en uno de los laterales hay un compartimento donde se encuentran otras cinco.\n\nPor mis años jugando al ajedrez, sé que la reina es una figura que puede moverse en cualquier dirección y recorrer cualquier distancia sobre el tablero. Por eso me sorprende que las tres que ya están colocadas no interfieran entre sí de ninguna forma.\n\nMi instinto me dice que debo colocar las cinco reinas restantes de manera que ninguna se interponga en el camino de las demás.",
        "firstSupportText": "En este puzzle ayuda mucho dibujar por tu cuenta el tablero con las tres reinas que ya están colocadas. Si además empiezas a quitar todas las filas, columnas y diagonales que ya están cogidas, te darás cuenta de que no existen tantas opciones como creías.",
        "secondSupportText": "Algo que te puede servir de ayuda es conocer que no hay reinas en ninguna de las cuatro esquinas.",
        "thirdSupportText": "Si has seguido las indicaciones de las pistas 1 y 2, ya sabrás qué casillas están libres para colocar las 5 reinas que faltan. En este caso, hay tanto una columna como una fila que tienen 3 opciones disponibles. Donde intersecten va una reina. A partir de ahí, sacar el resto es coser y cantar."
    },
    "puzzle6": 
    {
        "puzzleStatementText": "En la nota que he recogido pone que, para saber la combinación del candado, solo debo averiguar el número que da solución al siguiente acertijo:\n\n\"Un día, en clase, una profesora les pidió a sus alumnos que cerraran los ojos y les colocó a todos una gorra en la cabeza. Cuando los niños los abrieron, dijo: A ver, niños, observad bien las gorras de vuestros compañeros. Los que vean seis o más gorras rojas se llevarán un globo rojo; el resto, un globo azul.\n\nSi tenemos en cuenta que hay un total de veinte niños, y que solo algunos recibieron un globo rojo, ¿cuántos globos rojos repartió la profesora?\"\n\nResolver este rompecabezas me dará el número que tanto busco.",
        "firstSupportText": "Para resolver este acertijo, lo más importante es determinar primero cuántos niños llevaban una gorra roja. Para ayudarte a comenzar, puede ser útil saber que, si la profesora ha repartido globos rojos, también ha distribuido gorras de este color. Por lo tanto, el número que buscas es mayor que 0.",
        "secondSupportText": "Dado que no todos los niños se han llevado un globo rojo, esto implica que el número de gorras rojas es menor que el máximo posible, que en este caso es 20.",
        "thirdSupportText": "La clave para resolver este puzle está en la palabra \"algunos\". Simplemente prueba diferentes números de gorras repartidas y observa el resultado. Notarás que la solución siempre se reduce a dos valores que ya has descartado, excepto en un caso. Con esto, podrás deducir el número correcto de gorras, y a partir de ahí, el de globos."
    },
    "puzzle7": 
    {
        "puzzleStatementText": "Sobre la mesa se extiende un panel con cinco huecos para colocar las cartas. Justo encima se distinguen unas instrucciones que indican cómo lograr la victoria en este reto:\n\n\"Para ganar, deberás ordenar correctamente los cuatro ases y el Joker, siguiendo estas condiciones:\n\n- El as de corazones debe estar siempre a la izquierda del otro as de su mismo color, aunque no sepas su posición exacta.  \n- Ni el Joker ni el as de tréboles pueden ocupar la primera ni la última posición.  \n- El as de picas debe situarse dos lugares a la derecha del as de diamantes.  \n- Solo hay un par de cartas del mismo color que están juntas.\"\n\nDebo encontrar la disposición correcta si quiero hacerme con la victoria en este reto.",
        "firstSupportText": "Cuando se indica que el as de picas debe ir dos posiciones a la derecha del as de diamantes, esto puede parecer simple, pero en realidad te proporciona más información de la que parece. Hay solo tres posiciones posibles donde puedes colocar el as de diamantes para que esto se cumpla. Además, sabes que el as de picas aparecerá necesariamente después de este. Con esta información, ya deberías tener una idea más clara de dónde pueden ir cada uno de los dos ases.",
        "secondSupportText": "Recuerda que el as de corazones siempre debe estar a la izquierda del as de diamantes, que es el otro as de su mismo color. Considerando la primera pista, esto restringe las opciones y deja solo dos posiciones posibles para el as de corazones y otras dos para el as de diamantes. Recuerda también seguir el orden de los ases: primero el as de corazones, luego el as de diamantes y, finalmente, el as de picas.",
        "thirdSupportText": "Con todo lo que sabes hasta ahora por las pistas, también debes considerar que ni el Joker ni el as de tréboles pueden estar al inicio o al final de la secuencia. Por lo tanto, ya deberías saber cuál es la primera y la última carta entre las otras tres que quedan. Sumando la última indicación que te da el problema, solo existe una posibilidad que cumpla con todos los criterios."
    },
    "puzzle8": 
    {
        "puzzleStatementText": "",
        "firstSupportText": "",
        "secondSupportText": "",
        "thirdSupportText": ""
    }
}